Revit 2026 API

# ThermalAsset Class

---

Represents the properties of a material pertinent to energy analysis.

SystemObject Autodesk.Revit.DBThermalAsset

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ThermalAsset : IDisposable
```
```vb
Public Class ThermalAsset
	Implements IDisposable
```
```cpp
public ref class ThermalAsset : IDisposable
```
```fsharp
type ThermalAsset =
    class
        interface IDisposable
    end
```

The ThermalAsset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ThermalAsset | Constructs an instance of ThermalAsset. |

|  | Name | Description |
| --- | --- | --- |
|  | Behavior | Flag indicating whether elements of this material behave isotropically or orthotropically. |
|  | Compressibility | The compressibility of the asset. |
|  | Density | The density of the asset. |
|  | ElectricalResistivity | The electrical resistivity of the asset. |
|  | Emissivity | The emissivity of the asset. |
|  | GasViscosity | The gas viscosity of the asset. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LiquidViscosity | The liquid viscosity of the asset. |
|  | Name | The name of the thermal asset. |
|  | Permeability | The permeability of the asset. |
|  | Porosity | The porosity of the asset. |
|  | Reflectivity | The reflectivity of the asset. |
|  | SpecificHeat | The specific heat of the asset. |
|  | SpecificHeatOfVaporization | The specific heat of vaporization of the asset. |
|  | ThermalConductivity | The thermal conductivity of the asset. |
|  | ThermalMaterialType | The type of material that this thermal asset describes (e.g. solid, liquid, gas.) |
|  | TransmitsLight | A boolean flag that indicates whether or not the asset transmits light. |
|  | VaporPressure | The vapor pressure of the asset. |

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Produces a copy of the asset. |
|  | Dispose | Releases all resources used by the ThermalAsset |
|  | Equals(Object) | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Equals(ThermalAsset) | Determines whether this thermal asset is equal to another. |
|  | EqualsThermalOnly | Determines whether this thermal asset is equal to another, but ignore data from base class. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace